tutorials/compressible/PBNS/cpbnsLTS/RAEplane_M090_a1/0/T
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 275.3872;

boundaryField
{
wingL
{
    type            slip;
}

wingR
{
    type            slip;
}

tail
{
    type            slip;
}

fuselage
{
    type            slip;
}

lateralL
{
    type            zeroGradient;
}

lateralR
{
    type            zeroGradient;
}

top
{
    type            zeroGradient;
}

outlet
{
    type            zeroGradient;
}

bottom
{
    type            fixedValue;
    value           uniform 275.3872;
}

inlet
{
    type            fixedValue;
    value           uniform 275.3872;
}
}


// ************************************************************************* //
