tutorials/compressible/PBNS/cpbnsLTS/RAEplane_M090_a1/0/U
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (299.35814 5.2253 0.0);

boundaryField
{
wingL
{
    type            slip;
}

wingR
{
    type            slip;
}

tail
{
    type            slip;
}

fuselage
{
    type            slip;
}

lateralL
{
    type            zeroGradient;
}

lateralR
{
    type            zeroGradient;
}

top
{
    type            zeroGradient;
}

outlet
{
    type            zeroGradient;
}

bottom
{
    type            fixedValue;
    value           uniform (299.35814 5.2253 0.0);
}

inlet
{
    type            fixedValue;
    value           uniform (299.35814 5.2253 0.0);
}
}


// ************************************************************************* //
