tutorials/compressible/PBNS/cpbnsLTS/RAEplane_M090_a1/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         localEuler rDeltaT;
}

gradSchemes
{
    default         Gauss  skewCorrected linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss skewCorrected linearKoren;
    div(phiHat,p)   Gauss skewCorrected linearKoren;
    div(phi,h)      Gauss skewCorrected linearKoren;
    div((muEff*dev2(T(grad(U))))) Gauss skewCorrected linear;
    div(U,p)        Gauss skewCorrected linearKoren;
}

laplacianSchemes
{
    default         Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default           skewCorrected linear;
}

snGradSchemes
{
    default            skewCorrected corrected;
}


// ************************************************************************* //
